Revit 2027 API
MEPSystem.HasDesignParts Property
 Indicates if the system has one or more design parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasDesignParts { get; }
Public ReadOnly Property HasDesignParts As Boolean
	Get
public:
property bool HasDesignParts {
	bool get ();
}
member HasDesignParts : bool with get
Property Value
Boolean
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace